---
kind: enumMember
id: F:Autodesk.Revit.DB.EaveCutterType.TwoCutSquare
enum: Autodesk.Revit.DB.EaveCutterType
source: html/e07e48f8-2ed3-8022-9905-4c5efbf2f185.htm
---
# Autodesk.Revit.DB.EaveCutterType.TwoCutSquare

Two Cut Square type of Eave.